mui('.mui-bar-transparent').transparent({
    top: 0,
    offset: 150,
    duration: 16,
    scrollby: document.querySelector('.mui-scroll-wrapper')
})
$(function(){
	$('#content_foot .iconfont').css('color','#000')
	$("#content_foot .iconfont").on('click',function(){
		if($("#content_foot .iconfont").css('color','#000')){
			$(this).css('color','red');
		}else{
			$(this).css('color','#000');
		}
	});
	//detail
	var development_1=echarts.init(document.getElementById('development_1'));
	var xAxis=['9:30','9:31','9:32','9:33','9:34','9:35','9:36','9:37','9:38','9:39','9:40','9:41','9:42','9:43','9:44'];
	var line_1=['10.36','10.39','10.33','10.34','10.38','10.36','10.34','10.38','10.42','10.46','10.39','10.41','10.39','10.44','10.42',];
	var line_2=['-2.79','-2.39','-2.09','-1.79','-1.59','-1.99','-1.79','-1.94','-1.59','-1.99','-1.79','-1.94','-2.22','-2.79','-3.11',];
	var develop_1={
	    grid:{
	    	top:0,   	
	    },
	    xAxis: [{
	        type: 'category',
	        boundaryGap: false,
	        splitLine: { //网格线
	            show: true,
	            lineStyle: {
	                color: ['#b1b1b1'],
	            }
	        },
	        data: xAxis
	    }],
	    yAxis: [{
	        type: 'value',
	        min:10.16,
	        max:10.84
	    }, {
	        type: 'value',
	        min:-3.24,
	        max:3.24,
	        axisLabel: {
	            formatter: '{value}% '
	        },
	        splitLine: {
	        show: false
	        }
	    }],
	    series: [{
	        type: 'line',
	        yAxisIndex: 1,
	        smooth: true,
	        itemStyle: {
	            normal: {
	                color: '#f7b851'
	            }
	        },
	        data: line_2
	        },
	        {
	        name: 'speed(m/min)',
	        type: 'line',
	        smooth: true,
	        data: line_1,
	        itemStyle: {
	            normal: {
	                color: '#58c8da'
	            }
	        },
	        areaStyle: {
	            normal: {
	                color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
	                    offset: 0,
	                    color: 'rgba(0, 136, 212, 0.3)'
	                }, {
	                    offset: 0.8,
	                    color: 'rgba(0, 136, 212, 0.05)'
	                }], false),
	                shadowColor: 'rgba(0, 0, 0, 0.1)',
	                shadowBlur: 10
	            }
	        },
        }]
	}
	development_1.setOption(develop_1);
	
	var development_2=echarts.init(document.getElementById('development_2'));
	var develop_2={
		grid:{
	    	left:'10%',  
	    },
	    color: ["#f9882c", "#24c5fb"],
		xAxis: [
	        {
	            type: 'category',
	            show:false,
	            data: ['60天','59天','58天','57天','56天','55天','54天','53天','52天','51天','50天','49天','48天','47天','46天','45天','44天','43天','42天','41天','40天','39天','38天','37天','36天','35天','34天','33天','32天','31天','30天','29天','28天','27天','26天','25天','24天','23天','22天','21天','20天','19天','18天','17天','16天','15天','14天','13天','12天','11天','10天','9天','8天','7天','6天','5天','4天','3天','2天','1天',]
	        }
	    ],
	    yAxis: [
	        {
	            type: 'value',
	            axisLabel: {
	            formatter: function(data){
	            	var data=parseInt(data/100);
	            	return data
	            }
	        },
	        }
	        
	    ],
	    series: [
	        {
	            name:'16年',
	            type:'bar',
	            data:[3551.802, 4136.257, 4559.393, 5257.429, 3424.733, 3692.649, 3910.937, 4128.071, 5092.252, 9292.271, 7628.872, 4955.066, 5745.762, 7454.019, 5584.853, 6474.681, 4157.239, 1140.963, 5770.516, 6662.236, 9277.539, 4308.161, 8194.347, 3025.598, 7245.64, 6144.833, 7557.532, 3117.875, 7222.225, 1084.26, 4582.032, 5616.531, 4872.36, 2180.969, 2751.46, 3807.572, 7638.069, 2770.526, 3105.93, 2383.276, 2358.833, 2652.792, 3475.77, 3436.109, 5300.575, 6524.124, 4768.864, 5272.896, 5839.247, 6217.868, 8690.558, 1900.661, 4313.384, 7697.405, 2772.287, 3964.086, 5068.949, 1648.338, 5627.265, 5804.26]
	        },
	        {
	            name:'17年',
	            type:'bar',
	            data:[3322.494, 3452.39, 3610.984, 5823.577, 5237.974, 5627.981, 3800.603, 3724.812, 3743.68, 3733.013, 9998.011, 1663.065, 1633.057, 4639.493, 2402.539, 4418.056, 6508.711, 5829.843, 8271.181, 1820.459, 1522.969, 5996.679, 7067.692, 9254.388, 1044.257, 1566.173, 3157.306, 6933.738, 8671.483, 9329.037, 1190.788, 1250.9, 2570.118, 3319.355, 2980.489, 1766.332, 1423.335, 1441.598, 2089.245, 2824.937, 3312.156, 2218.35, 2402.72, 2995.655, 3660.913, 4334.042, 6667.541, 8099.731, 5869.456, 7051.901, 7783.052, 9069.175, 5653.473, 1462.83, 1377.841, 1468.897, 1616.782, 1592.215, 1146.593, 5408.593]
	        }
	    ]
       
	}
	development_2.setOption(develop_2);
})


